Revit 2027 API
DoubleArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	ref double item
)
Public Overridable Sub Append (
	ByRef item As Double
)
public:
virtual void Append(
	double% item
)
abstract Append :
        item : float byref -> unit
override Append :
        item : float byref -> unit
Parameters
item Double
See Also
Reference
DoubleArray Class
Autodesk.Revit.DB Namespace